# Мастям гральних карт присвоєно порядкові номери: 1 - піки, 2 - трефи, 3 - бубни, 4 - черви.
# Вартості карт, які старші за десятку, привласнені номери: 11 - валет, 12 - дама, 13 - король, 14 - туз.
# Дано два цілих числа: N - вартість (6 ≤ N ≤ 14) і M - масть карти (1 ≤ M ≤ 4). Вивести назву
# відповідної карти виду «шістка бубон», «дама черв», «туз треф», тощо.
n = int(input("enter the cost = "))
m = int(input("enter the suit = "))


def show_suit(m):
    switcher = {
        1: "піка",
        2: "треф",
        3: "бубни",
        4: "чирва",
    }
    return switcher.get(m, "Invalid suit")


def show_cost(n):
    switcher = {
        6: "шістка",
        7: "сімка",
        8: "вісімка",
        9: "дев'ятка",
        10: "десятка",
        11: "валет",
        12: "дама",
        13: "король",
        14: "туз",
    }
    return switcher.get(n, "Invalid cost")


print(show_cost(n) + " " + show_suit(m))
