# Дано натуральне число. Потрібно визначити, чи є рік з даними номером високосним. Якщо рік є
# високосним, то виведіть YES, інакше виведіть NO. Нагадаємо, що відповідно до григоріанським
# календарем, рік є високосним, якщо його номер кратний 4, але не кратний 100, а також якщо він
# кратний 400.
x = int(input("enter the year"))


def leap_year(x):
    if x % 4 == 0:
        if x % 100 != 0:
            print("YES")
        else:
            if x % 400 == 0:
                print("YES")
            else:
                print("NO")
    else:
        print("NO")


leap_year(x)
